### QUICK REVISION NOTES 10

## What is pandas

1. Pandas is a python library that is built on top of numpy. 
2. The name 'pandas' has a reference to both 'panel data' and 'python data analysis'. 
3. It is created in the year of 2008 by Wes McKinney.
4. Pandas is used to analyse big data and make conculsion based on statistical theories.
5. It has functions for analyzing, cleaning, exploring, and manipulating data.

### Importing and using pandas

In [1]:
import pandas as pd     # Importing pandas library
print(pd.__version__)   # To check numpy version
print(len(dir(pd)))     # number of functions available within pandas

1.1.3
140

### Pandas Series

1. Pandas series is a one dimensional labeled array that is capabale of holding data of any types.
2. The axis label of a series is called as index.
3. Simply, series can be defined as column in a table/excel.

In [28]:
# Creating a simple pandas series

name_lst = ['john', 'job', 'sam', 'thomas', 'mike']  # Creating a list of elements
pd_srs= pd.Series(name_lst)                          # Assigning the list to pandas series
pd_srs

# by default the index values starts from 0 and goes till the data exhausts

0      john
1       job
2       sam
3    thomas
4      mike
dtype: object

In [48]:
# assigning index to the pandas series

# While creating:
ipd_srs = pd.Series(name_lst, index=list(range(11,16)))
print('Assigning index while creating pandas series:')
print(ipd_srs)

# After creating
ipd_srs.index = [101,102,103,104,105]
print('\nAssigning / changing index after creating pandas series:')
print(ipd_srs)

Assigning index while creating pandas series:
11      john
12       job
13       sam
14    thomas
15      mike
dtype: object

Assigning / changing index after creating pandas series:
101      john
102       job
103       sam
104    thomas
105      mike
dtype: object

In [56]:
# Creating a Series from an array

import numpy as np
arr = np.arange(1,6)
apd_srs = pd.Series(arr, index = ['a', 'b', 'c', 'd', 'e'])
print(apd_srs)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [55]:
# Creating a series from a dictionary

dct = {'john':850000, 'job':750000, 'sam':400000, 'thomas':650000, 'mike':450000}
dpd_srs = pd.Series(dct)
print(dpd_srs)

john      850000
job       750000
sam       400000
thomas    650000
mike      450000
dtype: int64

In [3]:
# Creating Serires by values and index from list

state_lst = ['TN', 'KL', 'AP', 'KA', 'MP', 'RJ']
capital_lst = ['CHN', 'TVM', 'HYD', 'BLR', 'BHO','JAP']
state_capital = pd.Series(capital_lst, index = state_lst)
print(state_capital)

TN    CHN
KL    TVM
AP    HYD
KA    BLR
MP    BHO
RJ    JAP
dtype: object

In [21]:
# Accessing elements of the series

# Indexing and slicing

print(state_capital[3])     # can be accesd by index number
print(state_capital['TN'])  # can be accessed by index name
print(state_capital[1:4])   # accessing a array by slicing

# index and values
print('\nIndex of state_capital:', state_capital.index)
print('Values of state_capital:', state_capital.values)

BLR
CHN
KL    TVM
AP    HYD
KA    BLR
dtype: object

Index of state_capital: Index(['TN', 'KL', 'AP', 'KA', 'MP', 'RJ'], dtype='object')
Values of state_capital: ['CHN' 'TVM' 'HYD' 'BLR' 'BHO' 'JAP']

### Dataframe

1. Pandas dataframe is a two dimensional data structure
2. It is similar to 2-D array or a table with rows and columns

### Creating a dataframe

In [14]:
# Creating a simple dataframe
country = ['India', 'Canada', 'USA', 'Singapore', 'Australia']
s_df = pd.DataFrame(country, columns = ['country_name'], index = list(range(1,6)))
s_df

  country_name
1        India
2       Canada
3          USA
4    Singapore
5    Australia

In [20]:
# creating dataframe from a dictionary
dct = {'emp_id':['001','002','003','004','005','006'], 
       'emp_name':['Tom','bob','jerry','matt','steve','nick'],
       'emp_sal': [800000,500000,600000,650000,560000,1000000]}

dct_df = pd.DataFrame(dct)
dct_df

  emp_id emp_name  emp_sal
0    001      Tom   800000
1    002      bob   500000
2    003    jerry   600000
3    004     matt   650000
4    005    steve   560000
5    006     nick  1000000

In [25]:
# Creating a dataframe from a nested list

nst_lst = [[2002, 'Japan', 'Brazil', 161], 
                [2006, 'Germany', 'Italy', 147], 
                [2010, 'South Africa', 'Spain', 145],
                [2014, 'Brazil', 'Germany', 171]
              ]
lst_df = pd.DataFrame(nst_lst, columns=['Year','Host','Winner','Goals'])
lst_df

   Year          Host   Winner  Goals
0  2002         Japan   Brazil    161
1  2006       Germany    Italy    147
2  2010  South Africa    Spain    145
3  2014        Brazil  Germany    171

### Importing data

1. Most comman file type to save a huge data is CSV and Excel
2. These files can be imported into pandas as dataframes

In [27]:
# importing a CSV file

# syntax - pd.read_csv()
# paste the complete directory with file name and extension as raw string to import from different directory
# use file name with extension if the file present in current location of notebook

csv_df = pd.read_csv('weather_data.csv')
csv_df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [32]:
# importing a excel file

# syntax - pd.read_excel()
# paste the complete directory with file name and extension as raw string to import from different directory
# use file name with extension if the file present in current location of notebook

excel_df = pd.read_excel(r'/home/krishna/Desktop/Git repo/Digital notes/1. Python/football_worldcup.xlsx')
excel_df

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

### Operations on dataframe

##### To view the shape and size

In [37]:
print('Shape of the dataframe is:',excel_df.shape)
print('Size of the data is:',excel_df.size)         # gives the no.of.elements

Shape of the dataframe is: (7, 6)
Size of the data is: 42

##### To view first 5 data from the dataframe

In [39]:
excel_df.head()

   Year  Country    Winner Runners-Up  GoalsScored  MatchesPlayed
0  1990    Italy  Germany   Argentina          115             52
1  1994      USA    Brazil      Italy          141             52
2  1998   France    France     Brazil          171             64
3  2002    Japan    Brazil    Germany          161             64
4  2006  Germany     Italy     France          147             64

##### To view first 'n' data from the dataframe

In [42]:
excel_df.head(3)

   Year Country    Winner Runners-Up  GoalsScored  MatchesPlayed
0  1990   Italy  Germany   Argentina          115             52
1  1994     USA    Brazil      Italy          141             52
2  1998  France    France     Brazil          171             64

##### To view last 5 data from the dataframe

In [41]:
excel_df.tail()

   Year       Country   Winner   Runners-Up  GoalsScored  MatchesPlayed
2  1998        France   France       Brazil          171             64
3  2002         Japan   Brazil      Germany          161             64
4  2006       Germany    Italy       France          147             64
5  2010  South Africa    Spain  Netherlands          145             64
6  2014        Brazil  Germany    Argentina          171             64

##### To view last 'n' data from the dataframe

In [44]:
excel_df.tail(3)

   Year       Country   Winner   Runners-Up  GoalsScored  MatchesPlayed
4  2006       Germany    Italy       France          147             64
5  2010  South Africa    Spain  Netherlands          145             64
6  2014        Brazil  Germany    Argentina          171             64

##### To view all the column names

In [46]:
print(excel_df.columns)

Index(['Year', 'Country', 'Winner', 'Runners-Up', 'GoalsScored',
       'MatchesPlayed'],
      dtype='object')

##### To view the datapoints of particular column / columns

In [71]:
excel_df['Winner']

0    Germany
1      Brazil
2      France
3      Brazil
4       Italy
5       Spain
6     Germany
Name: Winner, dtype: object

In [69]:
excel_df[['Winner','Year']]

     Winner  Year
0  Germany   1990
1    Brazil  1994
2    France  1998
3    Brazil  2002
4     Italy  2006
5     Spain  2010
6   Germany  2014

##### To view the datapoints of particular column and row (row by index)

In [73]:
excel_df['Winner'][5]

'Spain'

##### Slicing the dataframe

In [74]:
excel_df[3:6]

   Year       Country  Winner   Runners-Up  GoalsScored  MatchesPlayed
3  2002         Japan  Brazil      Germany          161             64
4  2006       Germany   Italy       France          147             64
5  2010  South Africa   Spain  Netherlands          145             64

In [75]:
excel_df[::2]

   Year  Country    Winner Runners-Up  GoalsScored  MatchesPlayed
0  1990    Italy  Germany   Argentina          115             52
2  1998   France    France     Brazil          171             64
4  2006  Germany     Italy     France          147             64
6  2014   Brazil   Germany  Argentina          171             64

### Statistical operations on dataframe

In [79]:
# To view all the statistical details of dataframe
csv_df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

##### To view maximum of a column

In [82]:
csv_df.temperature.max()

35

##### To view min of a column

In [83]:
csv_df.temperature.min()

24

##### To view mean, medain, mode of a column

In [87]:
csv_df.windspeed.mean()

4.666666666666667

In [85]:
csv_df.temperature.median()

31.5

In [84]:
csv_df.temperature.mode()

0    32
dtype: int64